# Taps
tap 'hashicorp/tap'
tap 'go-task/tap'
tap 'derailed/k9s'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'grep'
brew 'wget'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts
brew 'go'

# Development
cask 'iterm2'
brew 'nvm'
brew 'pyenv'
brew 'ruby-build'
brew 'rbenv'
brew 'firebase-cli'
cask 'gcloud-cli'
brew 'azure-cli'
brew 'docker-compose'
cask 'temurin'
brew 'graphviz'
brew 'fastlane'
brew 'hashicorp/tap/terraform'
brew 'gnupg'
brew 'tflint'
brew 'lazygit'
brew 'apktool'
brew 'htop'
brew 'kdoctor'
brew 'pdm'
brew 'rsync'
brew 'go-task/tap/go-task'
brew 'goose'
brew 'uv'
brew 'helm'
brew 'watch'
brew 'postgresql'
brew 'derailed/k9s/k9s'

# Apps
cask 'caffeine'
cask 'discord'
cask 'docker-desktop'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'flutter'
cask 'spotify'
cask 'jetbrains-toolbox'
cask 'teamviewer'
cask 'postman'
cask 'transmission'
cask 'rectangle'
cask 'keka'
cask 'bruno'
cask 'yubico-yubikey-manager'
cask 'obsidian'
cask 'mitmproxy'
cask 'vlc'
cask 'scroll-reverser'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
