# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'wget'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts

# Development
brew 'nvm'
brew 'pyenv'
brew 'firebase-cli'
cask 'google-cloud-sdk'

# Apps
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'flutter'
cask 'spotify'
cask 'jetbrains-toolbox'
cask 'teamviewer'
cask 'postman'
cask 'transmission'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
